[
	{
		"sr": 1,
		"name": "Rukmini S",
		"role": "Founder and Director, Data For India",
		"title": "The Data Is Here.",
		"subtitle": "But Whom Is It Serving?",
		"talkType": "keynote",
		"kickerText": "Opening keynote",
		"talkInfo": "The last ten years have seen a dramatic improvement in access to Indian data, allowing journalists to tell richer stories, analysts to get a better sense of Indian realities, and designers to have much more to work with. Improvements are now happening faster than ever, more so with the adoption of machine learning and large language models. How do we use this moment to do better than we had imagined? By asking the important questions. \n<br><br>\nWe talk too little about what goes into the making of data, who has access to information and who doesn't, and who is able to work with it or make sense of it and not, and how we are using this data and to what end. In this talk, I hope to share some data that grounds my insights, and encourage us to engage with these questions.",
		"time": "27 June | 09:30 - 10:00 am",
		"location": "Bangalore International Centre, Bengaluru",
		"collection": 2,
		"analysis": 5,
		"coding": 3,
		"designing": 4,
		"narrating": 5,
		"strength": "Narrating insights",
		"link": "https://hasgeek.com/VizChitra/2025/sub/the-data-is-here-but-whom-is-it-serving-T8JzpVLF6VruwBTE6rP8zR",
		"scale": null,
		"xOffset": -20,
		"yOffset": 15,
		"hidden": null,
		"image": "speaker-rukmini.avif"
	},
	{
		"sr": 2,
		"name": "S ANAND",
		"role": "LLM Psychologist @ Straive and CEO @ Gramener",
		"title": "Data Design By Dialogue.",
		"subtitle": "Visualising Data with LLMs",
		"talkType": "keynote",
		"kickerText": "Closing keynote",
		"talkInfo": "In this live session, we'll walk through how to go from a bare prompt to a polished, shareable chart - entirely by conversing with a language model. Along the way, you'll see real demos, such as the Web Features Explorer, the Elimination Game, and an LLM mental math evaluation. \n\n<br><br>\nYou'll also learn how to: <br>\n\n1. Use ChatGPT instead of Jupyter Notebooks, Figma, or D3 as the canvas for data storytelling\n<br>\n2. Engineer prompts that generate valid data analyses and visualizations\n<br>\n3. Iteratively refine axis scales, colors, and annotations - without writing a single line of code\n<br>\n4. Automate interpretation by asking the model for captions, tooltips, and data insights\n<br>\n5. Spotlight future trends: what generative data art might look like in six months",
		"time": "27 June | 04:15 - 04:45 pm",
		"location": "Bangalore International Centre, Bengaluru",
		"collection": 5,
		"analysis": 5,
		"coding": 5,
		"designing": 5,
		"narrating": 5,
		"strength": "Narrating insights",
		"link": "https://hasgeek.com/VizChitra/2025/sub/data-design-by-dialogue-visualizing-data-with-llms-EX3YtVF1mqSqnxY5LAtuRE",
		"scale": 0.9,
		"xOffset": -30,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-anand.avif"
	},
	{
		"sr": 3,
		"name": "Yashna Jhamb",
		"role": "Co-founder, Ooloi Labs",
		"title": "Making Sense of Stories:",
		"subtitle": "Structuring Qualitative Data at Scale",
		"talkType": "lightning talk",
		"kickerText": null,
		"talkInfo": "Qualitative data is often considered messy, anecdotal, and hard to scale - yet it holds immense power to illuminate nuance, lived experience, and patterns that numbers alone can't tell. Drawing from my experience as a researcher working on the ground across public health, education, and development sectors, this session will explore the often-overlooked value of qualitative data in shaping decisions, driving insights, and influencing change.\n<br><br>\nWe'll dive into how to make sense of qualitative data at scale - from collection and structuring to analysis and integration with quantitative insights. I'll share stories and challenges from working with large, distributed teams capturing observations, narratives, and open-ended feedback - and how we've learned to systematize this using OKF (Open Knowledge Framework), a platform built for qualitative data at scale. We'll explore real-world examples where qualitative data analysis has led to actionable insights, and what it takes to build processes and tools that honor the complexity of human stories.",
		"time": null,
		"location": null,
		"collection": 5,
		"analysis": 5,
		"coding": 4,
		"designing": 4,
		"narrating": 5,
		"strength": "Narrating insights",
		"link": "https://hasgeek.com/VizChitra/2025/sub/making-sense-of-stories-structuring-qual-data-at-s-MWBidJxMGVKyxum8i1cEhr",
		"scale": 1,
		"xOffset": null,
		"yOffset": -25,
		"hidden": null,
		"image": "speaker-yashna.avif"
	},
	{
		"sr": 4,
		"name": "Prasanta Kumar Dutta",
		"role": "Data Visualisation Developer, Reuters",
		"title": "The Eyes Have It:",
		"subtitle": "Understanding Perception-Driven Data Visualisation",
		"talkType": "standard talk",
		"kickerText": "Standard talk",
		"talkInfo": "Did you know that psychological principles developed over a century ago still shape modern graphic design and visual communication? The way we perceive patterns, group elements, and focus our attention is deeply rooted in human cognition - and understanding these principles can transform the way we communicate through data visualizations.\n<br><br>\nIn this session, we'll delve into the <strong>science of perception-based design</strong> concepts and the art of creating impactful charts, graphs, and infographics. Through real-world examples of data visualisations, we'll explore how simple design choices can enhance clarity, guide the viewer's eye, and improve storytelling with data.",
		"time": null,
		"location": null,
		"collection": 4,
		"analysis": 5,
		"coding": 5,
		"designing": 5,
		"narrating": 5,
		"strength": "Designing visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/the-eyes-have-it-understanding-perception-driven-d-2aERpLPse53SfYjSYW5XFi",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-prasanta.avif"
	},
	{
		"sr": 5,
		"name": "Saket Choudhary",
		"role": "Assistant Professor, IIT Bombay",
		"title": "India's Public Health Genome:",
		"subtitle": "A Visual Story of Anomalies, Trajectories, Correlations and Geographies",
		"talkType": "lightning talk",
		"kickerText": null,
		"talkInfo": "Did you know most babies in India are born in the second half of the year? And that, the temperature has a strong association with the number of conceptions?\n<br><br>\nIndia's '<strong>public health genome</strong>' is vast, dynamic, and sometimes chaotic - just like its genetic code. In this talk, I will present a visual journey through India's health landscape, one base at a time, covering the <strong>\"ATCGs\" - Anomalies, Trajectories, Correlations, and Gographies</strong>.\n<br><br>\nThrough carefully crafted charts, maps, and interactive visualizations, we'll explore: <br>\n\n1.<strong> A</strong>nomalies across different data sources <br>\n2. <strong>T</strong>rajectories of seasonality of births across geographies; seasonality of diseases and accidents across geographies and mortality trends <br>\n3. <strong>C</strong>orrelations: How climate change likely impacts conceptions (and disease-free births); how rainfall patterns drive diseases <br>\n4. <strong>G</strong>eographies: In India, any of the ATC has heterogeneity with respect to the geography - I will cover some of the statistical metrics and their visualization for quantifying the heterogeneity across states\n<br><br>\nThe talk combines principles of data storytelling, aesthetics, and accessibility to create narratives that resonate emotionally and intellectually. All the analysis is based on data that is available publicly but remains largely under utilized and under visualized. A vignette of some of the figures (including the two above) is available on my blog: https://genomeofindia.substack.com/ and through the introductory course in public health informatics 'DH302': https://saket-choudhary.me/DH302",
		"time": null,
		"location": null,
		"collection": 5,
		"analysis": 5,
		"coding": 4,
		"designing": 4,
		"narrating": 3,
		"strength": "Analyzing data",
		"link": "https://hasgeek.com/VizChitra/2025/sub/the-atcgs-of-indias-public-health-genome-a-visual-WHHeaYvzwyrEDGUhqeC8n5",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-saket.avif"
	},
	{
		"sr": 6,
		"name": "Aditi Bhat",
		"role": "Founder and Chief Spinner, Spinfinity",
		"title": "Data Visceralization:",
		"subtitle": "Moving Data, Spinning Stories",
		"talkType": "standard talk",
		"kickerText": "Standard talk",
		"talkInfo": "<strong>What if data could be felt, not just seen?</strong> In this talk, Aditi shares how a childhood love of hula hooping grew into a powerful way of understanding the world, and eventually, a creative approach to data storytelling. Drawing from her experiences with movement, math, and Data Feminism, she introduces Spinfinity, a program where kids explore complex ideas through play, patterns, and drawing instead of traditional tests.\n<br><br>\nYou'll hear how climate data was brought into motion using programmable poi and Laban Movement Analysis, creating performances where data is literally spun into light. The session ends with a live 3-minute performance, turning the iconic red-blue climate stripes into a moving, visual reminder of our changing world.\n",
		"time": null,
		"location": null,
		"collection": 3,
		"analysis": 5,
		"coding": 4,
		"designing": 5,
		"narrating": 5,
		"strength": "Designing visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/setting-the-context-how-data-journalism-is-redefin-QeX3UqdyBWupywXLwe3SUr",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-aditi.avif"
	},
	{
		"sr": 7,
		"name": "Aman Bhargava",
		"role": "Developer, Revisual Labs",
		"title": "The Unreasonable Effectiveness of Tinkering",
		"subtitle": null,
		"talkType": "lightning talk",
		"kickerText": null,
		"talkInfo": "Side projects keep me happy. I couldn't really imagine learning without them, and I think I've genuinely learnt the most about data, programming, and visualization while tinkering away on something that just caught my interest. This talk is about embracing that slightly chaotic, but very rewarding, world of side projects as a personal playground for learning. I want to share a little bit of my own journey so far, focusing on how these projects have helped me pick up skills in programming and data viz (the messy middle bits included, not just the shiny end results). I'll talk about how to approach finding ideas, trying to structure the work, making time when life gets busy, and figuring out ways to actually learn and see progress.\n<br><br>\nTo show this, I'll walk through a few examples of projects I've worked on and show how each one nudged me to learn a specific new tool or technique; from data collection and analysis (like for Votes in a Name) to mapping (like BLR Water Log) and web development. This whole approach also connects with something I'm actively thinking about and aiming for: the idea of becoming more 'T-shaped'. I find the concept of building a broad base of knowledge while also diving deeper into specific areas that really excite me quite compelling, and side projects feel like a very natural way to explore that path.",
		"time": null,
		"location": null,
		"collection": 5,
		"analysis": 5,
		"coding": 5,
		"designing": 5,
		"narrating": 4,
		"strength": "Coding visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/the-unreasonable-effectiveness-of-tinkering-HWu7i2WhMk7GHBeBaZMgTy",
		"scale": 0.75,
		"xOffset": -5,
		"yOffset": -55,
		"hidden": null,
		"image": "speaker-aman.avif"
	},
	{
		"sr": 8,
		"name": "Vikram Nayak",
		"role": "Founder, Chartboss",
		"title": "The UX of Charts",
		"subtitle": null,
		"talkType": "lightning talk",
		"kickerText": null,
		"talkInfo": "How can you use the best of UX and product thinking to better communicate your data insight? How does human perception, cognition and psychology affect the success of your charts?\n<br><br>\nCan data viz really be broken down into a framework or process? Yes it can! I'll explain my USER framework for data visualisation - a structured way to get to the right visual for your audience, everytime. This is the same framework on which we've built our flagship product, ChartBoss.\n<br><br>\nWe'll also go through multiple chart audits and makeovers to help illustrate each concept.",
		"time": null,
		"location": null,
		"collection": 4,
		"analysis": 5,
		"coding": 4,
		"designing": 5,
		"narrating": 5,
		"strength": "Designing visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/the-ux-of-charts-get-the-insight-across-every-time-DrGYcthTdJvPT3KvPBCCMj",
		"scale": 0.95,
		"xOffset": 10,
		"yOffset": 25,
		"hidden": null,
		"image": "speaker-vikram.avif"
	},
	{
		"sr": 9,
		"name": "Rahul Beniwal and Neel Lakhwani",
		"role": "Tibba Design Studio",
		"title": "Democratizing financial data for a growing India",
		"subtitle": null,
		"talkType": "lightning talk",
		"kickerText": null,
		"talkInfo": " Retail holdings as direct and indirect investors (through mutual funds) surged more than 10 times over the last 10 years, according to data from the National Stock Exchange (NSE). In a country of 320 million households, we now have 110 million unique investors.\n<br><br>\nWith this surge in the number of retail investors, the need to serve them the right information to base their investment decisions on is the need of the hour. The challenge for this demographic is that financial data is usually full of jargon, dense tables and complex charts - which they struggle to make sense of due to low financial literacy. And so, we set out to explore the question - what if people don't need more information, but clearer explanations?\n<br><br>\nWith that we set out to build Groww Stories.\n<br><br>\nThis talk will cover our journey in helping build Groww stories - a feature on the app designed to bring financial literacy to India's growing segment of first time retail investors. It brings financial stories and data to life in a way that's fun, engaging, and easy to understand while staying true to current events.\n<br><br>\nWe'll explore how this feature was conceptualized and built out iteratively. With each story having a less than 4 hour turnaround time, the design language was built on the fly with daily evolutions being the norm. Under the stories banner, we've worked on representing financial events in the context of present day and the past along with visualizing quarterly reports released by public companies.",
		"time": null,
		"location": null,
		"collection": 4,
		"analysis": 4,
		"coding": 4,
		"designing": 5,
		"narrating": 5,
		"strength": "Designing visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/democratizing-financial-data-for-a-growing-india-Dd38iBU6tSvKC7fNGHBMAf",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-rahul-neel.avif"
	},
	{
		"sr": 10,
		"name": "Srinivasan Ramani",
		"role": "Deputy National Editor, The Hindu",
		"title": "Data Journalism and Visualisation",
		"subtitle": "at a time of Print's decline",
		"talkType": "standard talk",
		"kickerText": "Standard talk",
		"talkInfo": "The presentation would be about journalism within the larger ambit of story-telling at a time of print in crisis. Story-telling in the print media has to adopt to a milieu where there is a multiplicity of news sources and immediate availability of a lot of content, but which are largely not subject to gate-keeping and verification. It has also got to adopt to a milieu where readership/ viewership has steadily moved away from print into new digital formats - online and video.\n<br><br>\nIn order to cater to a diverse audience and to establish a USP, print has to move beyond the idea of just being \"news sources of record\" into investigation, analysis, explanation and to put it in a nutshell - \"context setting\". Data journalism helps in a significant manner to situate print journalism in this new \"context setting\" idea. It helps in explanation, it helps in diversification of audience through innovative story-telling and it, by the very dint of its nature, helps in transition into new mediums.\n<br><br>\nThis talk will focus on ways and means we have used data for these aspects of context-setting - investigations, explanation and analysis. We will delve further into how new technologies such as Gen AI has eased the job of entering into these new vistas while enhancing our process of story-telling in a deeper and more engaging manner.",
		"time": null,
		"location": null,
		"collection": 5,
		"analysis": 5,
		"coding": 5,
		"designing": 4,
		"narrating": 5,
		"strength": "Narrating insights",
		"link": "https://hasgeek.com/VizChitra/2025/sub/setting-the-context-how-data-journalism-is-redefin-QeX3UqdyBWupywXLwe3SUr",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-srini.avif"
	},
	{
		"sr": 11,
		"name": "Sabhyata Jain",
		"role": "Product Designer, Microsoft",
		"title": "The invisible graph:",
		"subtitle": "Leveraging AI to design accessible data visualisations",
		"talkType": "lightning talk",
		"kickerText": null,
		"talkInfo": "Can you read an entire spreadsheet cell-by-cell through a straw? That's how blind people describe using a screen-reader for dataviz. In this talk we understand how when we try to design for the outlier we design for everyone.\n<br><br>\nData visualizations compress thousands of data points into a glance, unless you rely on audio. Even with ARIA labels, a screen reader still exposes information linearly, piling cognitive load until the user feels, in their words, \"like I'm seeing the world through a microscope.\" The result: lost time, lost grades, lost opportunities.\n<br><br>\n<strong>Our Hunch</strong>:\nWhat if AI could be your eyes and let you hear a data visuslisation.\n<br><br>\n We also take the time to go through the issues faced when making information accessible and the pitfalls and learnings in making AI tools to bridge this gap in communication.\n<br><br>\n<strong>Takeaway</strong>: Learn actionable methods to make data viz accessible using established guidelines and emerging practices. ",
		"time": null,
		"location": null,
		"collection": 4,
		"analysis": 5,
		"coding": null,
		"designing": 5,
		"narrating": 5,
		"strength": "Designing visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/the-invisible-graph-leveraging-ai-to-make-data-vis-SrUaS5bWXe3SGbwmfHeyL9",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-sabhyata.avif"
	},
	{
		"sr": 12,
		"name": "Gyan Lakhwani",
		"role": "Design Educator, Founder at Public Knowledge Studio",
		"title": "Teaching Information Visualisation",
		"subtitle": null,
		"talkType": "bof",
		"kickerText": "Birds of a Feather",
		"talkInfo": "How would you introduce dataviz in a classroom? Visual insights stick, but how do you make the learning slick? At #VizChitra2025, join an open discussion (or as we like to call it a Birds of a Feather session) on \"Teaching Information Visualisation\". Whether you're an educator or curious about teaching data, come swap notes, approaches, and ideas. \n<br><br>\nThe session is a chance to reflect on what works (and what doesn't) when bringing dataviz into the classroom. Bring your questions and experiments. The only syllabus is yours! \n<br><br>\nFacilitated by Gyan Lakhwani, a design educator, visiting faculty at Department of Design, Delhi Technological University, and founder at Public Knowledge Studio, a plural design practice",
		"time": null,
		"location": null,
		"collection": 4,
		"analysis": 2,
		"coding": 4,
		"designing": 5,
		"narrating": 4,
		"strength": "Coding visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/teaching-information-visualisation-VaYWrEcBSxEqFryPWCjkTm",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-gyan.avif"
	},
	{
		"sr": 13,
		"name": "Gopika",
		"role": "Legal Research Associate, Enfold Proactive Health Trust",
		"title": "Whose Analysis is it Anyway?",
		"subtitle": "The Role of AI and Humans in Data Analysis and Visualization",
		"talkType": "bof",
		"kickerText": "Birds of a Feather",
		"talkInfo": "Artificial Intelligence is rapidly reshaping the world of data - leading to many of us who work with data, wondering what the role of humans will look like in the future.\n<br><br>\nThis group chat invites participants to ponder several questions together in the context of data analysis and visualization:\n<br><br>\n1. Which parts of the process can be outsourced to AI? <br>\n2. What are the risks associated with ethics or bias, and how can we work with them? <br>\n3. Is there a tradeoff between speed and nuance? <br>\n4. Which parts of this are humans still necessary for? <br>\n5. What is AI not good at doing? <br>\n6. Is there something we will never be okay with AI doing?\n<br><br>\nWhat can you expect from this discussion?<br><br>\n1. A space to exchange perspective on the extent of the current role of AI in the context of data analysis and visualization, and imagine what it could look like in the future <br>\n2. A space to think together about concerns to do with the role of AI, and how they can mitigate",
		"time": null,
		"location": null,
		"collection": 5,
		"analysis": 5,
		"coding": 4,
		"designing": 5,
		"narrating": 5,
		"strength": "Designing visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/whose-analysis-is-it-anyway-the-role-of-ai-and-hum-8xVeJYL1H4dQPY1pTiPR7F",
		"scale": 0.8,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-gopika.avif"
	},
	{
		"sr": 14,
		"name": "S ANAND",
		"role": "LLM Psychologist @ Straive CEO @ Gramener",
		"title": "Prompt-to-Plot:",
		"subtitle": "Crafting Visual Stories with LLMs",
		"talkType": "workshop",
		"kickerText": null,
		"talkInfo": "In this hands-on workshop, you'll go from zero to a live data visualization using <strong>only natural-language prompts</strong> (plus a dash of copy-&-paste). Turn raw data into a compelling narrative - all by chatting with an LLM. \n<br><br>\nNo coding knowledge is required (but it'll help a lot.) \n<br><br>\nNo API key required but you're welcome to bring your own. \n<br><br>\nThis will be an end-to-end workflow that designers, developers and data enthusiasts can follow verbatim.",
		"time": "28 June | 10:00AM - 01:00PM",
		"location": "Samagata Space, Church St",
		"collection": 5,
		"analysis": 5,
		"coding": 5,
		"designing": 5,
		"narrating": 5,
		"strength": "Coding visualizations",
		"link": "https://hasgeek.com/VizChitra/prompt-to-plot/",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-anand.avif"
	},
	{
		"sr": 15,
		"name": "ARVIND V",
		"role": "Adjunct Professor School of Management, DSU and Srishti Manipal Institute",
		"title": "Dancing with the Stars:",
		"subtitle": "No-Code Data Analysis & Visualisation",
		"talkType": "workshop",
		"kickerText": null,
		"talkInfo": "How can Bollywood / Hollywood stars, Literary Fiction heroes, and Sports champs help us understand, remember, and create all this Data, Data Viz, and Stats stuff?\n<br><br>\nTaking inspiration from stories, film videos, short stories, and sports, and a using point-and-click Photoshop-like software tool, we will make data and data visualizations and stats out of them.\n<br><br>\nWe will link stars to data at first and generate several charts that represent the stories we might already know. Then, we will conjure up data (from yet another movie) and develop an intuition statistical inference procedures as well.\n<br><br>\n1. Throwing it All Away with Brad Pitt: Data Summaries <br>\n2. Counting <s>Chickens</s> Letters with Sherlock Holmes <br>\n3. Nursery Rhymes with Ben Affleck <br>\n4. Being a Mermaid with Katie Ledecky <br>\n5. Jack and Rose lived happily ever after <br>\n6. The Art of Surprise with Gabbar Singh\n<br><br>\nAll with #OrangeDataMining and #NoCode.",
		"time": "28 June | 02:30PM - 05:30PM",
		"location": "Samagata Space, Church St",
		"collection": 5,
		"analysis": 5,
		"coding": 5,
		"designing": 5,
		"narrating": 5,
		"strength": "Coding visualizations",
		"link": "https://hasgeek.com/VizChitra/dancing-with-the-star/",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-arvind.avif"
	},
	{
		"sr": 16,
		"name": "ARUNDATHI RAJAN",
		"role": "Exhibition Design, National Institute of Design, Ahmedabad",
		"title": "Democratising Data:",
		"subtitle": "Stories using everyday objects",
		"talkType": "workshop",
		"kickerText": null,
		"talkInfo": "What power structures can be dismantled when the power to speak the language of data becomes accessible to everyone? The Daily Data Project is a workshop designed to engage in a discourse on creating data visualizations using everyday household objects. \n<br><br>\nThe workshop introduces a toolkit developed as a part of my graduation project, which acts as a vertical to simplify the visualization process. While the toolkit offers structure and encourages participants to experiment and explore freely, the key purpose of the workshop is to develop visualizations on a particular city's transport system and services. And for a city like Bangalore, the results would be quite interesting to observe.",
		"time": "28 June | 10:00AM - 01:00PM",
		"location": "Underline Center, 2nd Floor, Indiranagar",
		"collection": 5,
		"analysis": 5,
		"coding": 4,
		"designing": 5,
		"narrating": 5,
		"strength": "Designing visualizations",
		"link": "https://hasgeek.com/VizChitra/democratising-data-stories/",
		"scale": 1.75,
		"xOffset": 25,
		"yOffset": 85,
		"hidden": null,
		"image": "speaker-arundathi.avif"
	},
	{
		"sr": 17,
		"name": "SAMARTH GULATI",
		"role": "Software Engineer @ Postman",
		"title": "The Sonic Signature:",
		"subtitle": "Plotting Your Name's Audio Landscape",
		"talkType": "workshop",
		"kickerText": null,
		"talkInfo": "Ever wondered what the unique sound of your name looks like? In this hands-on workshop, we'll embark on an exciting journey to capture your \"sonic signature\" and translate it into a striking visual landscape.\n<br><br>\nWe'll begin by generating the audio waveform of your name using text-to-speech. We'll then delve into audio analysis, extracting meaningful data from the audio output. This data will form the foundation for our visualization.\n<br><br>\nNext, we'll explore data visualization, learning how to sculpt this processed audio data into a compelling visual representation inspired by the iconic and stark aesthetic of Joy Division's album artwork. By the end of this exercise, participants will have the opportunity to plot their visual representation, and take home as a physical artwork.\n",
		"time": "28 June | 02:30PM - 05:30PM",
		"location": "Underline Center, 2nd Floor, Indiranagar",
		"collection": 2,
		"analysis": 2,
		"coding": 5,
		"designing": 5,
		"narrating": 5,
		"strength": "Coding visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/the-sonic-signature-plotting-your-names-audio-land-338GFKxc1WGoTnpQywGEMs",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-samarth.avif"
	},
	{
		"sr": 18,
		"name": "PULAHA ROY",
		"role": "Senior Data Journalist, Centre for Science and Environment",
		"title": "Let's Get Mapping!",
		"subtitle": "(QGIS)",
		"talkType": "workshop",
		"kickerText": null,
		"talkInfo": "Of all the data visualisation forms available, maps have always fascinated me the most - it deals with data that is about us, the space we inhabit, and they just look wow. While there are many mapping softwares available, the one we will be focussing on is Quantum GIS or QGIS. Why QGIS? Because it's open source and a one-stop-solution for everything spatial.",
		"time": "28 June | 10:00AM - 01:00PM",
		"location": "Underline Center, 3rd Floor, Indiranagar",
		"collection": 4,
		"analysis": 4,
		"coding": 5,
		"designing": 5,
		"narrating": 4,
		"strength": "Designing visualizations",
		"link": "https://hasgeek.com/VizChitra/lets-get-mapping-with-qgis/",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-pulaha.avif"
	},
	{
		"sr": 19,
		"name": "SARATH GUTTIKUNDA and DAMMALAPATI SAI KRISHNA",
		"role": "Director; Research Associate, Urban Emissions Information LLP",
		"title": "Chitra-Lekha:",
		"subtitle": "Engaging with environmental storytelling through the lens of air pollution data",
		"talkType": "workshop",
		"kickerText": null,
		"talkInfo": "Schools taught us, \"We cannot see air, only feel it.\" But sadly now, we don't just feel it deep inside our lungs but also see it with our red, itchy eyes. But there is more than what our irritable eye can see.\n<br><br>\nThis session is about learning to see air using data from monitoring stations, modeling results, and satellites. Building a city's pollution storyline using visual aids, without missing the scientific rigor.",
		"time": "28 June | 02:30PM - 05:30PM",
		"location": "Underline Center, 3rd Floor, Indiranagar",
		"collection": 5,
		"analysis": 5,
		"coding": 5,
		"designing": 5,
		"narrating": 5,
		"strength": "Narrating insights",
		"link": "https://hasgeek.com/VizChitra/chitra-lekha/",
		"scale": 0.95,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-sarath-krishna.avif"
	},
	{
		"sr": 20,
		"name": "Sahana Ghosh and Kartik Chandramouli",
		"role": "Associate Editor, Nature India; Senior Digital Editor, Mongabay India",
		"title": "Lessons For Newsrooms From Data Visualisers",
		"subtitle": null,
		"talkType": "bof",
		"kickerText": "Birds of a Feather",
		"talkInfo": "In this peer-driven session, two journalists/editors will facilitate an open conversation with participants from across the data visualisation world. The session aims to explore the intersections and friction points between newsrooms and data visualisers, unpacking both challenges and collaboration opportunities. Through guided discussion, we'll crowdsource lessons, practical strategies, and ideas that can strengthen the connection between journalism and the wider data viz community.\n<br><br>\nModerators will briefly share behind-the-scenes insights into newsroom workflows, including common constraints like tight deadlines, limited design resources, and the undervaluing of visuals. Participants will be invited to reflect on questions around accessibility, trust, storytelling formats, and cross-sector collaboration. The session will also open up broader questions for those working outside journalism-touching on team structures, pay scales, ethics, audience engagement, and more.",
		"time": null,
		"location": null,
		"collection": 4.5,
		"analysis": 3,
		"coding": 2.5,
		"designing": 4.5,
		"narrating": 5,
		"strength": "Narrating insights",
		"link": "https://hasgeek.com/VizChitra/2025/schedule/lessons-for-newsrooms-from-data-visualisers-V7CYjPMT7cZcHVQeUPsKfE",
		"scale": 0.8,
		"xOffset": 10,
		"yOffset": 0,
		"hidden": null,
		"image": "speaker-sahana-kartik.avif"
	},
	{
		"sr": 21,
		"name": "Hardik Chandrahas",
		"role": "UX Designer, Nutanix",
		"title": "Bringing Order to Chaos:",
		"subtitle": "Designing Visualizations for Enterprise",
		"talkType": "sponsored talk",
		"kickerText": "Sponsored Talk",
		"talkInfo": "How can data visualization drive clarity in data-heavy enterprise world?\n<br><br>\nIn the enterprise/cloud-computing domain, data in a true sense of the word not only refers to the data generated by the system (performance metrics, alerts, read-write operations, time-values) but also the entities in the system that can vary as per their individual scale of occurrences. Visualization can enable different users to make sense of this data, and derive actionable insights.",
		"time": null,
		"location": null,
		"collection": 4,
		"analysis": 5,
		"coding": 4,
		"designing": 5,
		"narrating": 5,
		"strength": "Analyzing data",
		"link": "https://hasgeek.com/VizChitra/2025/sub/bringing-order-to-chaos-designing-visualizations-f-A5bmPCUNnrji6ogLxuRah3",
		"scale": null,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-hardik.avif"
	},
	{
		"sr": 22,
		"name": "Pragnya",
		"role": "Engineer, Data For India",
		"title": "Beyond Headlines:",
		"subtitle": "Understanding India Through Data",
		"talkType": "alternate",
		"kickerText": "Alternative Session",
		"talkInfo": "Good data on India can be hard to access and harder still to understand. The media often does not do its job of giving citizens the context about the country that they deserve. As a result, we are often left with an outsider's view of our own country.\n<br><br>\nWe propose a physical installation that invites participants to engage with their assumptions about the country, and what good Indian data (based on articles published on Data For India) can show us. Attendees will engage physically with a series of charts/ installations by marking their estimates on a series of data points. Each installation will pose a question, inviting participants to guess, vote or mark with a sticker. Responses will be collected over the day.\n<br><br>\nAt the end of the day we will analyze the responses and present our findings in a lightning talk. We aim to not only compare respondents' inputs with our data, but also help illuminate what good data can be, and how others can work with it. We'll also talk about our data operations and design thinking process in producing this work.",
		"time": null,
		"location": null,
		"collection": 4,
		"analysis": 5,
		"coding": 5,
		"designing": 5,
		"narrating": 5,
		"strength": "Coding visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/beyond-headlines-understanding-india-through-data-5J6iAy2yGck73DnjmsF5pr",
		"scale": null,
		"xOffset": null,
		"yOffset": 25,
		"hidden": null,
		"image": "speaker-pragnya.avif"
	},
	{
		"sr": 23,
		"name": "Prakriti Bakshi",
		"role": "Data Journalist, The Secretariat",
		"title": "VizChitra Data Trail:",
		"subtitle": "A way to connect, collect, and reflect",
		"talkType": "alternate",
		"kickerText": "Alternative Session",
		"talkInfo": "Conferences can be intense: Attending all kinds of sessions, finding the nerve to talk to people whose work you've fawned over, learning new things, and filling up your \"To Learn\" list. A dataviz conference full of nerds, meeting at such a scale in India for the first time is bound to be a lot (in the best way). But, it's going to go by in a blur.\n<br><br>\nThe VizChitra Data Trail is a way to slow down without missing out. Let a postcard nudge you to observe, interact, and remember the day with simple prompts you can fill in throughout the conference.\n<br><br>\nBreak the ice and capture the small moments with this alternative session-VizChitra's way of breaking the mould with immersive formats beyond the stage.\n<br><br>\nOpen the last page of your conference notebooks and you'll find a way to connect, collect, and reflect with tiny activities that turn your experience into a unique visual souvenir one squiggle, stamp, and word at a time.",
		"time": null,
		"location": null,
		"collection": 4,
		"analysis": 5,
		"coding": 4,
		"designing": 5,
		"narrating": 5,
		"strength": "Narrating insights",
		"link": "https://hasgeek.com/VizChitra/2025/sub/vizchitra-data-trail-a-way-to-connect-collect-and-5gEeMigFWZzm6JPvS4FWKx",
		"scale": null,
		"xOffset": null,
		"yOffset": 22,
		"hidden": null,
		"image": "speaker-prakriti.avif"
	},
	{
		"sr": 24,
		"name": "Anushka Gokhale and Rutu Tank",
		"role": "Senior Product Designer; Associate Product Designer, Parallel HQ",
		"title": "You Had One Job:",
		"subtitle": "Chart Edition",
		"talkType": "alternate",
		"kickerText": "Alternative Session",
		"talkInfo": "\"A designer is a cunning plotter laying his traps.\" Vilem Flusser in his essay 'About the Word Design' talks about how design can be deceptive. Everything can be anything if the designer wants it to be. The line between bad design and misunderstood intent is often blurry. It's easier to appreciate and make good design once you have experienced the worst of it.\n<br><br>\nThe project began as an in-class critique activity and evolved into a full-blown exploration of how viz can go wrong-and what that teaches us about getting it right. Asking the students to create bad data viz was easier since it made their journey into the new space less daunting.\n<br><br>\nWe bring to you a curated collection of visualisations gone made wrong. Some are redesigned versions of otherwise great charts, intentionally made worse. Others are tongue-in-cheek visual parodies, inspired by creators like Soren Iverson who use satire to question the logic of everyday design.\n<br><br>\nThe exhibit also features a checklist of common traps or mistakes that can be avoided, gathered from classroom conversations. And it doesn't stop there-attendees are invited to contribute! Printed or scribbled, all additions are welcome.",
		"time": null,
		"location": null,
		"collection": 4,
		"analysis": 5,
		"coding": 3,
		"designing": 5,
		"narrating": 5,
		"strength": "Narrating insights",
		"link": "https://hasgeek.com/VizChitra/2025/sub/you-had-one-job-chart-edition-QWa6KsEswfEMpTP9Uiy8Vh",
		"scale": 0.75,
		"xOffset": null,
		"yOffset": -4,
		"hidden": null,
		"image": "speaker-anusha-rutu.avif"
	},
	{
		"sr": 25,
		"name": "Rama Krushna Behera",
		"role": "Product Designer, Razorpay",
		"title": "Planet Under Pressure:",
		"subtitle": "Designing Tools for Environmental Storytelling",
		"talkType": "alternate",
		"kickerText": "Alternative Session",
		"talkInfo": "\"Planet Under Pressure\" is a real-time interactive installation that brings the Earth's condition to life through immersive visuals and sound. Using a MIDI controller with knobs/ sliders, participants can adjust key human-driven environmental factors such as air pollution, water pollution, deforestation, urbanization, overpopulation, waste generation, industrial activity, and climate change accelerators. Each knob corresponds to one factor, allowing users to explore the cause-and-effect relationship between human actions and environmental degradation.\n<br><br>\nThe installation will be built using TouchDesigner, a visual programming tool that enables real-time rendering of complex visual systems. As users turn the knobs, they witness immediate and dramatic shifts in the Earth's state-from lush and thriving to damaged and chaotic. Glowing forests may fade, oceans may darken, and atmospheric haze might thicken. These changes are reinforced by generative ambient soundscapes that shift in tone and intensity based on the planet's health, making the experience emotionally powerful and easy to grasp, even for those new to environmental topics or generative art.\n<br><br>\nAs participants turn knobs/ sliders on the MIDI controller, they trigger environmental tipping points-watching the planet go from lush and thriving to dark, cracked, and dystopian. Through delayed feedback loops, regeneration mechanics, and audiovisual shifts, the experience makes climate data visceral and urgent.",
		"time": null,
		"location": null,
		"collection": 3,
		"analysis": 4,
		"coding": 5,
		"designing": 5,
		"narrating": 3,
		"strength": "Designing visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/planet-under-pressure-designing-tools-for-environm-Wh3axwwugE3n1YDTrtrZLt",
		"scale": null,
		"xOffset": null,
		"yOffset": 30,
		"hidden": null,
		"image": "speaker-rama-krushna.avif"
	},
	{
		"sr": 26,
		"name": "Ashok Kumar",
		"role": "Artist | Actor | Musician",
		"title": "Finding your Rhythm",
		"subtitle": "Djembe Solo",
		"talkType": "alternate",
		"kickerText": "Alternative Session",
		"talkInfo": "This session is part interaction, part performance. It is about understanding & finding your own rhythm - when you are alone, when you are part of a group or when you are attending a conference like VizChitra 2025.\n<br><br>\nIt starts with listening & observing your own interaction. What is the beat you are playing? Then, explore who you are within the group. How do you co-ordinate and express yourself within a group - when you are leading or following? Finally, find your own rhythm in a group. You start to understand your unique beat & pattern within groups and maybe, beyond that in life.\n<br><br>\nUsing simple exercises like clapping & a percussion instrument - djembe, Ashok will help us all to get started on this journey",
		"time": null,
		"location": null,
		"collection": 4,
		"analysis": 2,
		"coding": 1,
		"designing": 1,
		"narrating": 5,
		"strength": "Narrating insights",
		"link": "https://hasgeek.com/VizChitra/2025/schedule/finding-your-rhythm-djembe-solo-LRnBwW6MscizaHr7rk8Jrv",
		"scale": 1.5,
		"xOffset": null,
		"yOffset": 75,
		"hidden": null,
		"image": "speaker-ashok.avif"
	},
	{
		"sr": 27,
		"name": "Aditeya Pandey",
		"role": "Senior Advisor, Head of Visual Analytics Hub, Eli Lilly and Company",
		"title": "Data Visualization at Lilly:",
		"subtitle": "Designing Visuals that Solve, Simplify, and See Ahead",
		"talkType": "sponsored talk",
		"kickerText": "Sponsored Talk",
		"talkInfo": "In today's data-rich biopharmaceutical landscape, visualization helps teams solve complex problems, simplify insights, and anticipate future outcomes. This talk explores how Lilly is applying data visualization across the R&D pipeline, from early discovery through clinical development, regulatory engagement, and beyond.\n<br><br>\nWe will discuss the challenges of redesigning clinical study results to meet the diverse needs of stakeholders, the limitations of static graphics, and the increasing demand for custom, interactive tools that support multidimensional data exploration. As AI and machine learning become central to drug discovery, we will envision the role of visualization will play in interpreting model outputs, ensuring transparency, and fostering trust. Finally, we'll explore how generative AI will empower non-experts to create domain-relevant visualizations, unlocking new potential for efficiency and scale.\n",
		"time": null,
		"location": null,
		"collection": 5,
		"analysis": 5,
		"coding": 5,
		"designing": 5,
		"narrating": 5,
		"strength": "Coding visualizations",
		"link": "https://hasgeek.com/VizChitra/2025/sub/data-visualization-at-lilly-designing-visuals-that-257S1oVQNmeYPqDE2gGEz7",
		"scale": 0.8,
		"xOffset": null,
		"yOffset": null,
		"hidden": null,
		"image": "speaker-aditeya.avif"
	}
]
